driver-tests/encoder/EncoderTests/TestHL7EncoderBP/src/Receive/ReceiveInput.wsdl

<?xml version="1.0" encoding="UTF-8"?>
<definitions
    name="ReceiveInput"
    xmlns="http://schemas.xmlsoap.org/wsdl/"
    targetNamespace="http://j2ee.netbeans.org/wsdl/TestHL7Encoder/ReceiveInput"
    xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/"
    xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/"
    xmlns:xsd="http://www.w3.org/2001/XMLSchema"
    xmlns:tns="http://j2ee.netbeans.org/wsdl/TestHL7Encoder/ReceiveInput"
    xmlns:plnk="http://docs.oasis-open.org/wsbpel/2.0/plnktype">
    <types/>
    <message name="ReceiveInputOperationRequest">
        <part name="rioIn" type="xsd:string"/>
    </message>
    <message name="ReceiveInputOperationReply">
        <part name="rioOut" type="xsd:string"/>
    </message>
    <portType name="ReceiveInputPortType">
        <wsdl:operation name="ReceiveInputOperation">
            <wsdl:input name="input1" message="tns:ReceiveInputOperationRequest"/>
            <wsdl:output name="output1" message="tns:ReceiveInputOperationReply"/>
        </wsdl:operation>
    </portType>
    <binding name="ReceiveInputBinding" type="tns:ReceiveInputPortType">
        <soap:binding style="rpc"
            transport="http://schemas.xmlsoap.org/soap/http"/>
        <wsdl:operation name="ReceiveInputOperation">
            <soap:operation/>
            <wsdl:input name="input1">
                <soap:body use="literal"
                    namespace="http://j2ee.netbeans.org/wsdl/TestHL7Encoder/ReceiveInput"/>
            </wsdl:input>
            <wsdl:output name="output1">
                <soap:body use="literal"
                    namespace="http://j2ee.netbeans.org/wsdl/TestHL7Encoder/ReceiveInput"/>
            </wsdl:output>
        </wsdl:operation>
    </binding>
    <service name="ReceiveInputService">
        <wsdl:port name="ReceiveInputPort" binding="tns:ReceiveInputBinding">
            <soap:address location="http://localhost:18181/HL7EncoderService/ReceiveInputPort"/>
        </wsdl:port>
    </service>
    <plnk:partnerLinkType name="ReceiveInput1">
        <!-- A partner link type is automatically generated when a new port type is added. Partner link types are used by BPEL processes. 
In a BPEL process, a partner link represents the interaction between the BPEL process and a partner service. Each partner link is associated with a partner link type.
A partner link type characterizes the conversational relationship between two services. The partner link type can have one or two roles.-->
        <plnk:role name="ReceiveInputPortTypeRole" portType="tns:ReceiveInputPortType"/>
    </plnk:partnerLinkType>
</definitions>
