driver-tests/encoder/EncoderTests/TestHL7EncoderApp/test/DecodeEncode/Input.xml

<soapenv:Envelope xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:rec="http://j2ee.netbeans.org/wsdl/TestHL7Encoder/ReceiveInput">
  <soapenv:Body>
    <rec:ReceiveInputOperation>
      <rioIn>MSH|^~\&amp;|REGADT|MCM|IFENG||199112311501||ADT^A04^ADT_A01|000001|P|2.4|||&#13;EVN|A04|199901101500|199901101400|01||199901101410&#13;PID|||191919^^GENHOS^MR~371-66-9256^^^USSSA^SS|253763|MASSIE^JAMES^A||19560129|M|||171 ZOBERLEIN^^ISHPEMING^MI^49849^&quot;&quot;^||(900)485-5344|(900)485-5344||S^^HL70002|C^^HL70006|10199925^^^GENHOS^AN|371-66-9256||&#13;NK1|1|MASSIE^ELLEN|SPOUSE^^HL70063|171 ZOBERLEIN^^ISHPEMING^MI^49849^&quot;&quot;^|(900)485-5344|(900)545-1234~(900)545-1200|EC1^FIRST EMERGENCY CONTACT^HL70131&#13;NK1|2|MASSIE^MARYLOU|MOTHER^^HL70063|300 ZOBERLEIN^^ISHPEMING^MI^49849^&quot;&quot;^|(900)485-5344|(900)545-1234~(900)545-1200|EC2^SECOND EMERGENCY CONTACT^HL70131&#13;NK1|3&#13;NK1|4|||123 INDUSTRY WAY^^ISHPEMING^MI^49849^&quot;&quot;^||(900)545-1200|EM^EMPLOYER^HL70131|19940605||PROGRAMMER|||ACME SOFTWARE COMPANY&#13;PV1||O|O/R||||0148^ADDISON,JAMES|0148^ADDISON,JAMES||AMB|||||||0148^ADDISON,JAMES|S|1400|A|||||||||||||||||||GENHOS|||||199501101410|&#13;PV2||||||||199901101400|||||||||||||||||||||||||199901101400&#13;ROL||AD|CP^^HL70443|0148^ADDISON,JAMES&#13;OBX||NM|3141-9^BODY WEIGHT^LN||62|kg|||||F&#13;OBX||NM|3137-7^HEIGHT^LN||190|cm|||||F&#13;DG1|1|19|R63.4^LOSS OF WEIGHT^I10|||00|&#13;GT1|1||MASSIE^JAMES^&quot;&quot;^&quot;&quot;^&quot;&quot;^&quot;&quot;^||171 ZOBERLEIN^^ISHPEMING^MI^49849^&quot;&quot;^|(900)485-5344|(900)485-5344||||SE^SELF^HL70063|371-66-925||||MOOSES AUTO CLINIC|171 ZOBERLEIN^^ISHPEMING^MI^49849^&quot;&quot;|(900)485-5344|&#13;IN1|0|0^HL70072|BC1|BLUE CROSS|171 ZOBERLEIN^^ISHPEMING^M149849^&quot;&quot;^||(900)485-5344|90||||||50 OK|</rioIn>
    </rec:ReceiveInputOperation>
  </soapenv:Body>
</soapenv:Envelope>